Revit 2027 API
ExtendedPropertiesLinkData Constructor
 Constructs an empty object which can be used to add parameter schemas, bindings, and values.
Namespace: Autodesk.Revit.DB.ExternalData
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ExtendedPropertiesLinkData()
Public Sub New
public:
ExtendedPropertiesLinkData()
new : unit -> ExtendedPropertiesLinkData
Remarks
 The container name must be specified before the link data can be used by a [!:Autodesk::Revit::DB::ExternalData::ExtendedPropertiesLinkLoadContent].
See Also
Reference
ExtendedPropertiesLinkData Class
Autodesk.Revit.DB.ExternalData Namespace